PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ctb.h
/***************************************************************************//**
* \file cy_autanalog_ctb.h
* \version 2.0
*
* Provides an API declaration of the CTB subsystem of the Autonomous Analog.
*
********************************************************************************
* \copyright
* Copyright 2022-2025 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_autanalog_ctb
* \{
* This driver provides API functions to configure the CTB subsystem of the Autonomous Analog.
*
* The CTB block provides operational amplifiers (Opamps) for use in continuous-time signal chains.
* Each CTB includes two identical Opamps marked OA0 and OA1, a switch matrix for input/output routing, and
* the resistor ladder for each Opamp gain setting.
*
* For more information on the CTB,
* refer to the device Architecture Technical Reference Manual (TRM).\n
* For the exact location of the pins, see the device datasheet.
*
* \section group_autanalog_ctb_static Static Configuration
*
* The static configuration contains application-specific settings
* intended to remain static for any Opamp application.
* The Autonomous Controller (AC) will NOT change the static configuration during operation.
*
* \image html LPPASS_CTB_Static.png
*
* The static configuration of the Opamp includes:
* - Power mode;
* - Topology;
* - Interrupt mode (Comparator only);
* - Opamp compensation;\n
* For configuration settings, see \ref cy_stc_autanalog_ctb_sta_t.
*
* The Opamp topology in the CTB can be configured as follows:
* - Comparator (with or without hysteresis);
* \note The comparator output is not connected to pin and can only be used as an interrupt or trigger source.
* - Programmable Gain Amplifier (PGA, inverting and non-inverting, ground and Vref referenced);
* - Trans-impedance Amplifier (TIA);
* - Opamp with open loop (Potentiostat);
* - Differential Amplifier (DiffAmp);
* - Buffer (Voltage follower).
*
* \section group_autanalog_ctb_dynamic Dynamic Configuration and State Transition Table
*
* The dynamic configuration structure includes the Opamp settings,
* which can be modified by the Autonomous Controller (AC) during operation.
*
* \image html LPPASS_CTB_OpAmp_Dynamic.png
*
* The Autonomous Controller is able to modify the following characteristics of the CTB in runtime
* per settings provided in the State Transition Table:
* - Enable/Disable Opamp within the CTB;
* - Re-configure the switch matrix:
*    - change the connection of the non-inverting Opamp input to the pin or voltage reference;
*    - change the connection of the inverting Opamp input to the pin;
*    - change the connection of the bottom end of the resistor ladder to the pin or voltage reference;
* - Adjust the Opamps gain;
* For the configuration settings, see \ref cy_stc_autanalog_ctb_dyn_t and \ref cy_stc_autanalog_stt_ctb_t.
*
* <table class="doxtable">
*    <tr>
*       <th>Index</th>
*       <th>Gain</th>
*       <th>R-ladder, Ohm</th>
*       <th>Non-inv PGA</th>
*       <th>Inv PGA</th>
*       <th>DiffAmp</th>
*       <th>TIA</th>
*    </tr>
*    <tr>
*       <td>0</td>
*       <td>1.00</td>
*       <td>Rin = 192k, Rfb = 0</td>
*       <td>1.00</td>
*       <td>0</td>
*       <td>1.00</td>
*       <td>0k</td>
*    </tr>
*    <tr>
*       <td>1</td>
*       <td>1.42</td>
*       <td>Rin = 135k, Rfb = 57k</td>
*       <td>1.42</td>
*       <td>0.42</td>
*       <td>1.42</td>
*       <td>Rfb = 57k</td>
*    </tr>
*    <tr>
*       <td>2</td>
*       <td>2.00</td>
*       <td>Rin = 96k, Rfb = 96k</td>
*       <td>2.00</td>
*       <td>1.00</td>
*       <td>2.00</td>
*       <td>Rfb = 96k</td>
*    </tr>
*    <tr>
*       <td>3</td>
*       <td>2.78</td>
*       <td>Rin = 69k, Rfb = 123k</td>
*       <td>2.78</td>
*       <td>1.78</td>
*       <td>2.78</td>
*       <td>Rfb = 123k</td>
*    </tr>
*    <tr>
*       <td>4</td>
*       <td>4.00</td>
*       <td>Rin = 48k, Rfb = 144k</td>
*       <td>4.00</td>
*       <td>3.00</td>
*       <td>4.00</td>
*       <td>Rfb = 144k</td>
*    </tr>
*    <tr>
*       <td>5</td>
*       <td>5.82</td>
*       <td>Rin = 33k, Rfb = 159k</td>
*       <td>5.82</td>
*       <td>4.82</td>
*       <td>5.82</td>
*       <td>Rfb = 159k</td>
*    </tr>
*    <tr>
*       <td>6</td>
*       <td>8.00</td>
*       <td>Rin = 24k, Rfb = 168k</td>
*       <td>8.00</td>
*       <td>7.00</td>
*       <td>8.00</td>
*       <td>Rfb = 168k</td>
*    </tr>
*    <tr>
*       <td>7</td>
*       <td>10.67</td>
*       <td>Rin = 18k, Rfb = 174k</td>
*       <td>10.67</td>
*       <td>9.67</td>
*       <td>10.67</td>
*       <td>Rfb = 174k</td>
*    </tr>
*    <tr>
*       <td>8</td>
*       <td>16.00</td>
*       <td>Rin = 12k, Rfb = 180k</td>
*       <td>16.00</td>
*       <td>15.00</td>
*       <td>16.00</td>
*       <td>Rfb = 180k</td>
*    </tr>
*    <tr>
*       <td>9</td>
*       <td>21.33</td>
*       <td>Rin = 9k, Rfb = 183k</td>
*       <td>21.33</td>
*       <td>20.33</td>
*       <td>21.33</td>
*       <td>Rfb = 183k</td>
*    </tr>
*    <tr>
*       <td>10</td>
*       <td>32.00</td>
*       <td>Rin = 6k, Rfb = 186k</td>
*       <td>32.00</td>
*       <td>31.00</td>
*       <td>32.00</td>
*       <td>Rfb = 186k</td>
*    </tr>
* </table>
*
* \note For more information on the operating principles of the Autonomous Controller (static and dynamic configurations,
* State transition Table, etc.), refer to the corresponding chapter \ref group_autanalog_ac.
*
* \section group_autanalog_ctb_pump Opamp Input and Output Ranges
*
* The input range of the Opamp can be rail-to-rail if the charge pump is enabled.
* Without the charge pump, the input range is 0 V to VDDA - 1.5 V. The output range
* of the Opamp is typically 0.2 V to VDDA - 1.0 V and will depend on the load.
* See the device datasheet for more details.
*
* <table class="doxtable">
*    <tr>
*       <th>Charge Pump</th>
*       <th>Input Range</th>
*       <th>Output Range</th>
*    </tr>
*    <tr>
*       <td>Enabled</td>
*       <td>0 V to VDDA</td>
*       <td>0.2 V to VDDA - 0.2 V</td>
*    </tr>
*    <tr>
*       <td>Disabled</td>
*       <td>0 V to VDDA - 1.5 V</td>
*       <td>0.2 V to VDDA - 1.0 V</td>
*    </tr>
* </table>
*
* \note The charge pump nominal clock is 4MHz
*
* For the configuration settings, see \ref cy_en_autanalog_ctb_oa_pwr_t.
*
* \section group_autanalog_ctb_caps Opamp compensation
*
* The Opamp stability is affected by the phase delay caused by the
* resistance in the Opmap feedback and parasitic capacitance at the Opamp input.
* Therefore, a 4-bit programmable compensation capacitor block is added in parallel with the
* resistor in the Opmap feedback to optimize the stability of the Opamp performance.
* For the configuration settings, see \ref cy_en_autanalog_ctb_oa_fb_cap_t and \ref cy_en_autanalog_ctb_oa_cc_cap_t.
* \note Use the Autonomous Analog Configurator to define the actual capacitance value required for a particular configuration.
*
* \section group_autanalog_ctb_sample1 Sample use case: inverting PGA and Comparator
*
* \image html LPPASS_CTB_PGA_Comp.png
*
* \snippet autanalog/snippet/autanalog_ctb.c SNIPPET_CTB_CONFIG_COMMON
*
* \snippet autanalog/snippet/autanalog_ctb.c SNIPPET_CTB_CONFIG_PGA_COMP
*
* \snippet autanalog/snippet/autanalog_ctb.c SNIPPET_CTB_INIT_COMMON
*
* \snippet autanalog/snippet/autanalog_ctb.c SNIPPET_CTB_INIT_PGA_COMP
*
* \section group_autanalog_ctb_sample2 Sample use case: non-inverting PGA and Voltage follower
*
* \image html LPPASS_CTB_PGA_Buff.png
*
* \snippet autanalog/snippet/autanalog_ctb.c SNIPPET_CTB_CONFIG_COMMON
*
* \snippet autanalog/snippet/autanalog_ctb.c SNIPPET_CTB_CONFIG_PGA_BUFF
*
* \note The configuration must only be done while the AC is in High Speed mode,
* when \ref cy_stc_autanalog_stt_ac_t::lpMode is equal to FALSE.
*
* \snippet autanalog/snippet/autanalog_ctb.c SNIPPET_CTB_INIT_COMMON
*
* \snippet autanalog/snippet/autanalog_ctb.c SNIPPET_CTB_INIT_PGA_BUFF
*
* \defgroup group_autanalog_ctb_macros Macros
* \defgroup group_autanalog_ctb_functions Functions
*   \{
*       \defgroup group_autanalog_ctb_functions_init Initialization Functions
*   \}
* \defgroup group_autanalog_ctb_data_structures Data Structures
* \defgroup group_autanalog_ctb_enums Enumerated Types
*/

