PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ctb.h
#if !defined(CY_AUTANALOG_CTB_H)
#define CY_AUTANALOG_CTB_H

#include "cy_autanalog_common.h"

#ifdef CY_IP_MXS22LPPASS_CTB

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_autanalog_ctb_macros
* \{
*/

/** The maximum number of dynamic configurations that can to be used to configure the CTB,
 *  for more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_CTB_DYN_CFG_MAX                             (8UL)

/** \cond INTERNAL */

/* Helper macros for range validation */
#define AUTANALOG_CTB_COMP_IDX(value)                            ((value) < 2UL)

/** \endcond */

/** \} group_autanalog_ctb_macros */

/***************************************
*       Enumerated Types
***************************************/

/**
* \addtogroup group_autanalog_ctb_enums
* \{
*/

/**
* Configures the power mode and charge pump usage for each Opamp.
* Each power setting consumes different levels of current
* and supports a different input range and gain bandwidth.
* The charge pump is used to increase the input range to the rails.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_CTB_OA_PWR_OFF             = 0UL,  /**< The Opamp powering is off. */
    CY_AUTANALOG_CTB_OA_PWR_ULTRA_LOW       = 1UL,  /**< The Opamp power mode is ULTRA LOW,\n
                                                     *   the charge pump is OFF,\n
                                                     *   the Opamp quiescent current is 15uA.
                                                     *   If cy_stc_autanalog_ctb_dyn_t::outToPin: FALSE\n
                                                     *      the gain bandwidth is 30kHz;\n
                                                     *   If cy_stc_autanalog_ctb_dyn_t::outToPin: TRUE\n
                                                     *      the gain bandwidth is 100kHz;\n
                                                     *      and the drive capability of the Opamp output is 10uA; */
    CY_AUTANALOG_CTB_OA_PWR_ULTRA_LOW_RAIL  = 2UL,  /**< The Opamp power mode is ULTRA LOW,\n
                                                     *   the charge pump is ON,\n
                                                     *   the Opamp quiescent current is 35uA.
                                                     *   If cy_stc_autanalog_ctb_dyn_t::outToPin: FALSE\n
                                                     *      the gain bandwidth is 30kHz;\n
                                                     *   If cy_stc_autanalog_ctb_dyn_t::outToPin: TRUE\n
                                                     *      the gain bandwidth is 100kHz;\n
                                                     *      and the drive capability of the Opamp output is 10uA; */
    CY_AUTANALOG_CTB_OA_PWR_LOW_RAIL        = 4UL,  /**< The Opamp power mode is LOW,\n
                                                     *   the charge pump is ON,\n
                                                     *   the Opamp quiescent current is 150uA.
                                                     *   If cy_stc_autanalog_ctb_dyn_t::outToPin: FALSE\n
                                                     *      the gain bandwidth is 350kHz;\n
                                                     *   If cy_stc_autanalog_ctb_dyn_t::outToPin: TRUE\n
                                                     *      the gain bandwidth is 1.2MHz;\n
                                                     *      and the drive capability of the Opamp output is 100uA; */
    CY_AUTANALOG_CTB_OA_PWR_MEDIUM_RAIL     = 6UL,  /**< The Opamp power mode is MEDIUM,\n
                                                     *   the charge pump is ON,\n
                                                     *   the Opamp quiescent current is 200uA.
                                                     *   If cy_stc_autanalog_ctb_dyn_t::outToPin: FALSE\n
                                                     *      the gain bandwidth is 700kHz;\n
                                                     *   If cy_stc_autanalog_ctb_dyn_t::outToPin: TRUE\n
                                                     *      the gain bandwidth is 2.4MHz;\n
                                                     *      and the drive capability of the Opamp output is 1mA; */
    CY_AUTANALOG_CTB_OA_PWR_HIGH_RAIL       = 8UL,  /**< The Opamp power mode is HIGH,\n
                                                     *   the charge pump is ON,\n
                                                     *   the Opamp quiescent current is 600uA.
                                                     *   If cy_stc_autanalog_ctb_dyn_t::outToPin: FALSE\n
                                                     *      the gain bandwidth is 1.75MHz;\n
                                                     *   If cy_stc_autanalog_ctb_dyn_t::outToPin: TRUE\n
                                                     *      the gain bandwidth is 6MHz;\n
                                                     *      and the drive capability of the Opamp output is 1mA; */
    CY_AUTANALOG_CTB_OA_PWR_ULTRA_HIGH_RAIL = 10UL, /**< The Opamp power mode is ULTRA HIGH,\n
                                                     *   the charge pump is ON,\n
                                                     *   the Opamp quiescent current is 800uA.
                                                     *   If cy_stc_autanalog_ctb_dyn_t::outToPin: FALSE\n
                                                     *      the gain bandwidth is 2.8MHz;\n
                                                     *   If cy_stc_autanalog_ctb_dyn_t::outToPin: TRUE\n
                                                     *      the gain bandwidth is 7.5MHz;\n
                                                     *      and the drive capability of the Opamp output is 10mA; */

} cy_en_autanalog_ctb_oa_pwr_t;


/**
* Configures the predefined topology for the Opamps within the CTB
* (COMP (with/without hysteresis), PGA, TIA, Potentiostat, DiffAmp, Follower).
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_CTB_OA_TOPO_COMPARATOR      = 0UL, /**< The Opamp operational topology is Comparator without hysteresis */
    CY_AUTANALOG_CTB_OA_TOPO_PGA             = 1UL, /**< The Opamp operational topology is Programmable Gain Amplifier */
    CY_AUTANALOG_CTB_OA_TOPO_TIA             = 2UL, /**< The Opamp operational topology is Trans-impedance Amplifier */
    CY_AUTANALOG_CTB_OA_TOPO_OPEN_LOOP_OPAMP = 3UL, /**< The Opamp operational topology is Opamp with open loop\n
                                                     *  (cy_stc_autanalog_ctb_dyn_t::outToPin must be TRUE
                                                     *   for this configuration) */
    CY_AUTANALOG_CTB_OA_TOPO_DIFF_AMPLIFIER  = 4UL, /**< The Opamp operational topology is Differential Amplifier\n
                                                     *  (requires the same configuration for both Opamps) */
    CY_AUTANALOG_CTB_OA_TOPO_HYST_COMPARATOR = 5UL, /**< The Opamp operational topology is Comparator with hysteresis
                                                      *   \note The hysteresis is not a constant and depends on
                                                      *   \ref cy_en_autanalog_ctb_oa_pwr_t \n
                                                      *    ULTRA LOW:  80mV \n
                                                      *    LOW:        40mV \n
                                                      *    MEDIUM:     20mV \n
                                                      *    HIGH:       10mV \n
                                                      *    ULTRA HIGH: 4mV  \n */
    CY_AUTANALOG_CTB_OA_TOPO_BUFFER          = 6UL, /**< The Opamp operational topology is Voltage follower */

} cy_en_autanalog_ctb_oa_topo_t;


/**
* Configures the type of edge that triggers a comparator interrupt.
* \note This setting applies only to the Opamp in Comparator mode.
*/
typedef enum
{
    CY_AUTANALOG_CTB_COMP_INT_EDGE_DISABLED = 0UL, /**< Disabled, no interrupts detected */
    CY_AUTANALOG_CTB_COMP_INT_EDGE_RISING   = 1UL, /**< Rising edge generates an interrupt */
    CY_AUTANALOG_CTB_COMP_INT_EDGE_FALLING  = 2UL, /**< Falling edge generates an interrupt */
    CY_AUTANALOG_CTB_COMP_INT_EDGE_BOTH     = 3UL, /**< Both edges generate an interrupt */

} cy_en_autanalog_ctb_comp_int_t;


/**
* Configures the value of the feedback capacitor (Miller capacitance).
* The feedback capacitor (FB cap) is only used in the following configurations:
* PGA, TIA, Differential Amplifier
* (for the topologies 1, 2 or 4, in \ref cy_en_autanalog_ctb_oa_topo_t) and
* for non-unity value of the Opamp gain (\ref cy_en_autanalog_stt_ctb_oa_gain_t).
* Use the Autonomous Analog Configurator to define the actual capacitance value required for a particular configuration.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_CTB_OA_FB_CAP_0_pF    = 0UL,  /**< The capacitor is NOT connected in the feedback loop */
    CY_AUTANALOG_CTB_OA_FB_CAP_0_7_pF  = 1UL,  /**< The value of the feedback capacitor is 0.7 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_1_4_pF  = 2UL,  /**< The value of the feedback capacitor is 1.4 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_2_1_pF  = 3UL,  /**< The value of the feedback capacitor is 2.1 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_2_8_pF  = 4UL,  /**< The value of the feedback capacitor is 2.8 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_3_5_pF  = 5UL,  /**< The value of the feedback capacitor is 3.5 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_4_2_pF  = 6UL,  /**< The value of the feedback capacitor is 4.2 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_4_9_pF  = 7UL,  /**< The value of the feedback capacitor is 4.9 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_5_6_pF  = 8UL,  /**< The value of the feedback capacitor is 5.6 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_6_3_pF  = 9UL,  /**< The value of the feedback capacitor is 6.3 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_7_0_pF  = 10UL, /**< The value of the feedback capacitor is 7.0 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_7_7_pF  = 11UL, /**< The value of the feedback capacitor is 7.7 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_8_4_pF  = 12UL, /**< The value of the feedback capacitor is 8.4 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_9_1_pF  = 13UL, /**< The value of the feedback capacitor is 9.1 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_9_8_pF  = 14UL, /**< The value of the feedback capacitor is 9.8 pF */
    CY_AUTANALOG_CTB_OA_FB_CAP_10_5_pF = 15UL, /**< The value of the feedback capacitor is 10.5 pF */

