PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ctb.h
} cy_en_autanalog_ctb_oa_fb_cap_t;


/**
* Configures the value of the compensation capacitor (CC).
* The compensation capacitance must be activated together with the capacitance in the feedback loop
* \ref cy_en_autanalog_ctb_oa_fb_cap_t to optimize the stability of the Opamp.
* Use the Autonomous Analog Configurator to define the actual capacitance value required for particular configuration.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_CTB_OA_CC_CAP_0_1_pF   = 0UL,  /**< The value of the compensation capacitor is 0.1 pF */
    CY_AUTANALOG_CTB_OA_CC_CAP_1_1_pF   = 1UL,  /**< The value of the compensation capacitor is 1.1 pF */
    CY_AUTANALOG_CTB_OA_CC_CAP_2_1_pF   = 2UL,  /**< The value of the compensation capacitor is 2.1 pF */
    CY_AUTANALOG_CTB_OA_CC_CAP_3_1_pF   = 3UL,  /**< The value of the compensation capacitor is 3.1 pF */
    CY_AUTANALOG_CTB_OA_CC_CAP_4_1_pF   = 4UL,  /**< The value of the compensation capacitor is 4.1 pF */
    CY_AUTANALOG_CTB_OA_CC_CAP_5_1_pF   = 5UL,  /**< The value of the compensation capacitor is 5.1 pF */
    CY_AUTANALOG_CTB_OA_CC_CAP_6_1_pF   = 6UL,  /**< The value of the compensation capacitor is 6.1 pF */
    CY_AUTANALOG_CTB_OA_CC_CAP_7_1_pF   = 7UL,  /**< The value of the compensation capacitor is 7.1 pF */
    CY_AUTANALOG_CTB_OA_CC_CAP_DISABLED = 8UL,  /**< The compensation capacitor is NOT used */

} cy_en_autanalog_ctb_oa_cc_cap_t;


/**
* Configures the direct connection of the non-inverting input of the Opamp to the external pin.
* The CTB subsystem allows the non-inverting input of the Opamp to be connected directly to
* the pin by means of the switch routing matrix.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_CTB_OA_NINV_PIN_DISCONNECT    = 0UL, /**< The non-inverting inputs of the Opamps are not connected to pin */
    CY_AUTANALOG_CTB_OA_NINV_PIN_OA0_P0_OA1_P5 = 1UL, /**< The non-inverting inputs of the Opamps OA0, OA1
                                                       *   are connected to P0 and P5 respectively */
    CY_AUTANALOG_CTB_OA_NINV_PIN_OA0_P1_OA1_P4 = 2UL, /**< The non-inverting inputs of the Opamps OA0, OA1
                                                       *   are connected to P1 and P4 respectively */
} cy_en_autanalog_ctb_oa_ninv_pin_t;


/**
* Configures the direct connection of the non-inverting input of the Opamp to the Vref.
* The CTB subsystem allows the non-inverting input of the Opamp to be connected directly to
* the selected reference voltage using the switch routing matrix.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_CTB_OA_NINV_REF_DISCONNECT  = 0UL, /**< The non-inverting input of the Opamp is not connected to Vref */
    CY_AUTANALOG_CTB_OA_NINV_REF_DAC0        = 1UL, /**< The non-inverting input is connected to VREF0 (from DAC0) */
    CY_AUTANALOG_CTB_OA_NINV_REF_DAC1        = 2UL, /**< The non-inverting input is connected to VREF1 (from DAC1 */
    CY_AUTANALOG_CTB_OA_NINV_REF_PRB_OUT0    = 3UL, /**< The non-inverting input is connected to VREF2 (from PRB0) */
    CY_AUTANALOG_CTB_OA_NINV_REF_PRB_OUT1    = 4UL, /**< The non-inverting input is connected to VREF3 (from PRB1) */
    CY_AUTANALOG_CTB_OA_NINV_REF_VBGR        = 5UL, /**< The non-inverting input is connected to VBGR */
    CY_AUTANALOG_CTB_OA_NINV_REF_CTB_OA0_OUT = 6UL, /**< The non-inverting input is connected to the
                                                     *   output of the adjacent CTB OA0 \note OA from another CTB */
    CY_AUTANALOG_CTB_OA_NINV_REF_CTB_OA1_OUT = 7UL, /**< The non-inverting input is connected to the
                                                     *   output of the adjacent CTB OA1 \note OA from another CTB */
} cy_en_autanalog_ctb_oa_ninv_ref_t;


/**
* Configures the direct connection of the inverting input of the Opamp to the external pin.
* The CTB subsystem allows the inverting input of the Opamp to be connected directly to
* the pin using the switch routing matrix.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_CTB_OA_INV_PIN_DISCONNECT    = 0UL, /**< The inverting inputs of the Opamps are not connected to pin */
    CY_AUTANALOG_CTB_OA_INV_PIN_OA0_P0_OA1_P5 = 1UL, /**< The inverting inputs of the Opamps OA0, OA1
                                                      *   are connected to P0 and P5 respectively
                                                      */
    CY_AUTANALOG_CTB_OA_INV_PIN_OA0_P1_OA1_P4 = 2UL, /**< The inverting inputs of the Opamps OA0, OA1
                                                      *   are connected to P1 and P4 respectively
                                                      */
} cy_en_autanalog_ctb_oa_inv_pin_t;


/**
* Configures the direct connection of the bottom ends of the resistor ladders to the external pin.
* The CTB subsystem allows the bottom end of the resistor ladder in the Opamp to be connected directly to
* the pin using the switch routing matrix.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_CTB_OA_RES_PIN_DISCONNECT    = 0UL, /**< The bottom ends of the resistor ladders are not connected to the pin */
    CY_AUTANALOG_CTB_OA_RES_PIN_OA0_P0_OA1_P5 = 1UL, /**< The bottom ends of the resistor ladders of Opamps OA0, OA1
                                                      *   are connected to P0 and P5 respectively */
    CY_AUTANALOG_CTB_OA_RES_PIN_OA0_P1_OA1_P4 = 2UL, /**< The bottom ends of the resistor ladders of Opamps OA0, OA1
                                                      *   are connected to P1 and P4 respectively */
} cy_en_autanalog_ctb_oa_res_pin_t;


/**
* Configures the direct connection of the bottom ends of the resistor ladders to the Vref.
* The CTB subsystem allows the bottom end of the resistor ladder in the Opamp to be connected directly to
* the selected reference voltage using of the switch routing matrix.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_CTB_OA_RES_REF_DISCONNECT   = 0UL, /**< The bottom end of the resistor ladder is not connected
                                                         to the voltage reference */
    CY_AUTANALOG_CTB_OA_RES_REF_DAC0         = 1UL, /**< The bottom end of the resistor ladder is connected to
                                                     *   VREF0 (from DAC0) */
    CY_AUTANALOG_CTB_OA_RES_REF_DAC1         = 2UL, /**< The bottom end of the resistor ladder is connected to
                                                     *   VREF1 (from DAC1) */
    CY_AUTANALOG_CTB_OA_RES_REF_CTB_OA0_OUT  = 3UL, /**< The bottom end of the resistor ladder is connected to
                                                     *   the output of the adjacent CTB OA0
                                                     *   \note OA from another CTB */
    CY_AUTANALOG_CTB_OA_RES_REF_CTB_OA1_OUT  = 4UL, /**< The bottom end of the resistor ladder is connected to
                                                     *   the output of the adjacent CTB OA1
                                                     *   \note OA from another CTB */
    CY_AUTANALOG_CTB_OA_RES_REF_VSSA         = 5UL, /**< The bottom end of the resistor ladder is connected to VSSA */

