PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ctb.h
} cy_en_autanalog_ctb_oa_res_ref_t;


/**
* The CTB subsystem allows the pins to be connected directly to
* the internal analog bus using the input multiplexer for further routing.
* Must be used in conjunction with \ref cy_en_autanalog_ctb_oa_mux_out_t.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_CTB_OA_MUX_IN_DISCONNECT = 0UL, /**< The input multiplexer is disconnected */
    CY_AUTANALOG_CTB_OA_MUX_IN_P0         = 1UL, /**< Pin P0 is routed to the internal analog bus */
    CY_AUTANALOG_CTB_OA_MUX_IN_P1         = 2UL, /**< Pin P1 is routed to the internal analog bus */
    CY_AUTANALOG_CTB_OA_MUX_IN_P2         = 3UL, /**< Pin P2 is routed to the internal analog bus */
    CY_AUTANALOG_CTB_OA_MUX_IN_P3         = 4UL, /**< Pin P3 is routed to the internal analog bus */
    CY_AUTANALOG_CTB_OA_MUX_IN_P4         = 5UL, /**< Pin P4 is routed to the internal analog bus */
    CY_AUTANALOG_CTB_OA_MUX_IN_P5         = 6UL, /**< Pin P5 is routed to the internal analog bus */
    CY_AUTANALOG_CTB_OA_MUX_IN_P6         = 7UL, /**< Pin P6 is routed to the internal analog bus */
    CY_AUTANALOG_CTB_OA_MUX_IN_P7         = 8UL, /**< Pin P7 is routed to the internal analog bus */

} cy_en_autanalog_ctb_oa_mux_in_t;


/**
* The CTB subsystem allows the Opamp inputs or the bottom end of the resistor ladder
* to be connected directly to the internal analog bus via the output multiplexer.
* Must be used in conjunction with \ref cy_en_autanalog_ctb_oa_mux_in_t.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_CTB_OA_MUX_OUT_DISCONNECT = 0UL, /**< The output multiplexer is disconnected */
    CY_AUTANALOG_CTB_OA_MUX_OUT_NINV       = 1UL, /**< The internal analog bus is routed to the
                                                   *   Opamps non-inverting input */
    CY_AUTANALOG_CTB_OA_MUX_OUT_INV        = 2UL, /**< The internal analog bus is routed to the
                                                   *    Opamps inverting input */
    CY_AUTANALOG_CTB_OA_MUX_OUT_RES        = 3UL, /**< The internal analog bus is routed to the
                                                   *   Opamps bottom end of the resistor ladder */
} cy_en_autanalog_ctb_oa_mux_out_t;


/**
* The set of the gain configurations for the Opamp in the CTB.
* The gain of the Opamp can be modified by the Autonomous Controller during operation,
* per settings in the State Transition Table, see \ref cy_stc_autanalog_stt_t.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_STT_CTB_OA_GAIN_1_00  = 0UL,  /**< The value of the gain is 1.00. */
    CY_AUTANALOG_STT_CTB_OA_GAIN_1_42  = 1UL,  /**< The value of the gain is 1.42. */
    CY_AUTANALOG_STT_CTB_OA_GAIN_2_00  = 2UL,  /**< The value of the gain is 2.00. */
    CY_AUTANALOG_STT_CTB_OA_GAIN_2_78  = 3UL,  /**< The value of the gain is 2.78. */
    CY_AUTANALOG_STT_CTB_OA_GAIN_4_00  = 4UL,  /**< The value of the gain is 4.00. */
    CY_AUTANALOG_STT_CTB_OA_GAIN_5_82  = 5UL,  /**< The value of the gain is 5.82. */
    CY_AUTANALOG_STT_CTB_OA_GAIN_8_00  = 6UL,  /**< The value of the gain is 8.00. */
    CY_AUTANALOG_STT_CTB_OA_GAIN_10_67 = 7UL,  /**< The value of the gain is 10.67. */
    CY_AUTANALOG_STT_CTB_OA_GAIN_16_00 = 8UL,  /**< The value of the gain is 16.00. */
    CY_AUTANALOG_STT_CTB_OA_GAIN_21_33 = 9UL,  /**< The value of the gain is 21.33. */
    CY_AUTANALOG_STT_CTB_OA_GAIN_32_00 = 10UL, /**< The value of the gain is 32.00. */

} cy_en_autanalog_stt_ctb_oa_gain_t;

/** \} group_autanalog_ctb_enums */

/***************************************
*       Configuration Structures
***************************************/

/**
* \addtogroup group_autanalog_ctb_data_structures
* \{
*/

/**
* Defines the static configuration structure, see \ref group_autanalog_ctb_static.
* Used in \ref cy_stc_autanalog_ctb_t and \ref Cy_AutAnalog_CTB_LoadStaticConfig.
*/
typedef struct
{
    cy_en_autanalog_ctb_oa_pwr_t    pwrOpamp0;      /**< The Power mode for the Opamp0 */
    cy_en_autanalog_ctb_oa_topo_t   topologyOpamp0; /**< The topology configuration for Opamp0 */
    cy_en_autanalog_ctb_comp_int_t  intComp0;       /**< The Edge-detect comparator mode for Opamp0 */
    cy_en_autanalog_ctb_oa_fb_cap_t capFbOpamp0;    /**< The value of the feedback capacitor for Opamp0 */
    cy_en_autanalog_ctb_oa_cc_cap_t capCcOpamp0;    /**< The value of the compensation capacitor for Opamp0 */

    cy_en_autanalog_ctb_oa_pwr_t    pwrOpamp1;      /**< The Power mode for Opamp1 */
    cy_en_autanalog_ctb_oa_topo_t   topologyOpamp1; /**< The topology configuration for Opamp1 */
    cy_en_autanalog_ctb_comp_int_t  intComp1;       /**< The Edge-detect comparator mode for Opamp1 */
    cy_en_autanalog_ctb_oa_fb_cap_t capFbOpamp1;    /**< The value of the feedback capacitor for Opamp1 */
    cy_en_autanalog_ctb_oa_cc_cap_t capCcOpamp1;    /**< The value of the compensation capacitor for Opamp1 */

} cy_stc_autanalog_ctb_sta_t;


/**
* Defines the dynamic configuration structure, see \ref group_autanalog_ctb_dynamic.
* Used in \ref cy_stc_autanalog_ctb_t and \ref Cy_AutAnalog_CTB_LoadDynamicConfig.
*/
typedef struct
{
    cy_en_autanalog_ctb_oa_ninv_pin_t ninvInpPin;   /**< Connection of the non-inverting input of the Opamp to pin */
    cy_en_autanalog_ctb_oa_ninv_ref_t ninvInpRef;   /**< Connection of the non-inverting input of the Opamp to Vref */
    cy_en_autanalog_ctb_oa_inv_pin_t  invInpPin;    /**< Connection of the inverting input of the Opamp to pin */
    cy_en_autanalog_ctb_oa_res_pin_t  resInpPin;    /**< Connection of the bottom end of the resistor ladder to pin */
    cy_en_autanalog_ctb_oa_res_ref_t  resInpRef;    /**< Connection of the bottom end of the resistor ladder to Vref */
    cy_en_autanalog_ctb_oa_mux_in_t   sharedMuxIn;  /**< Connection of the pins to the input multiplexer in the CTB */
    cy_en_autanalog_ctb_oa_mux_out_t  sharedMuxOut; /**< Connection of the Opamp inputs to the output multiplexer in CTB */
    bool                              outToPin;     /**< Connection of the Opamp output to pin */

} cy_stc_autanalog_ctb_dyn_t;


/**
* The configuration structure to set up the entire CTB
* based on static and dynamic configurations.
* Used in \ref cy_stc_autanalog_cfg_t and \ref Cy_AutAnalog_CTB_LoadConfig.
*/
typedef struct
{
    /* Static part of configuration */
    cy_stc_autanalog_ctb_sta_t *ctbStaCfg;     /**< The pointer to a static part of the CTB configuration */

    /* Dynamic part of configuration */
    uint8_t                      ctbDynCfgNum; /**< The number of dynamic configurations used for the CTB */
    cy_stc_autanalog_ctb_dyn_t *ctbDynCfgArr;  /**< The array of pointers to dynamic configurations used for the CTB */

} cy_stc_autanalog_ctb_t;


