PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ctb.h
/** The CTB section in the State Transition Table state.
 * Used in \ref cy_stc_autanalog_stt_t.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef struct
{
    bool                              unlock;       /**< CTB Unlock\n
                                                     * FALSE - Locked:\n
                                                     *     Data from fields enableOpampX, cfgOpampX, gainOpampX
                                                     *     will NOT be taken into account in
                                                     *     the corresponding state of STT\n
                                                     * TRUE - Unlocked:\n
                                                     *     Data from fields enableOpampX, cfgOpampX, gainOpampX
                                                     *     will be used in the STT corresponding state
                                                     */
    /* Opamp0 */
    bool                              enableOpamp0; /**< Enable Opamp0 */
    uint8_t                           cfgOpamp0;    /**< The dynamic configuration selector for Opamp0 in the CTB,
                                                     *   see \ref cy_stc_autanalog_ctb_dyn_t,\n
                                                     *   the valid range is 0 to 7
                                                     */
    cy_en_autanalog_stt_ctb_oa_gain_t gainOpamp0;   /**< The gain control for Opamp0 in the CTB */

    /* Opamp1 */
    bool                              enableOpamp1; /**< Enable Opamp1 */
    uint8_t                           cfgOpamp1;    /**< The dynamic configuration selector for Opamp1 in the CTB,
                                                     *   see \ref cy_stc_autanalog_ctb_dyn_t,\n
                                                     *   the valid range is 0 to 7
                                                     */
    cy_en_autanalog_stt_ctb_oa_gain_t gainOpamp1;   /**< The gain control for Opamp1 in the CTB */

} cy_stc_autanalog_stt_ctb_t;

/** \} group_autanalog_ctb_data_structures */

/***************************************
*        Function Prototypes
***************************************/

/**
* \addtogroup group_autanalog_ctb_functions
* \{
*/

/**
* \addtogroup group_autanalog_ctb_functions_init
* This set of functions is used to configure the CTB.
* \{
*/

/*******************************************************************************
* Function Name: Cy_AutAnalog_CTB_LoadConfig
****************************************************************************//**
*
* Configures the CTB per provided static and dynamic settings.
*
* \note Enabling or disabling the Opamp requires a new initialization delay for the CTB subsystem.
* Use a global API \ref Cy_AutAnalog_LoadConfig instead of the local API.
*
* \param ctbIdx
* The index of the CTB subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::ctb
*
* \param ctbCfg
* The pointer to a structure containing the static and dynamic parts of the configuration data
* for the entire CTB.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_CTB_LoadConfig(uint8_t ctbIdx, const cy_stc_autanalog_ctb_t * ctbCfg);


/*******************************************************************************
* Function Name: Cy_AutAnalog_CTB_LoadStaticConfig
****************************************************************************//**
*
* Configures the CTB per settings in the static configuration structure.
*
* \note Enabling or disabling the Opamp requires a new initialization delay for the CTB subsystem.
* Use a global API \ref Cy_AutAnalog_LoadConfig instead of the local API.
*
* \param ctbIdx
* The index of the CTB subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::ctb
*
* \param ctbStaCfg
* The pointer to a structure containing static configuration data for the CTB.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_CTB_LoadStaticConfig(uint8_t ctbIdx, const cy_stc_autanalog_ctb_sta_t * ctbStaCfg);


/*******************************************************************************
* Function Name: Cy_AutAnalog_CTB_LoadDynamicConfig
****************************************************************************//**
*
* Configures the CTB per settings in the dynamic configuration structure.
* The dynamic configuration of the CTB can be modified by the Autonomous Controller during operation,
* per settings in the State Transition Table, see \ref cy_stc_autanalog_stt_t.
*
* \param ctbIdx
* The index of the CTB subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::ctb
*
* \param ctbDynCfgNum
* The actual number of dynamic configurations used to configure the CTB.
*
* \param ctbDynCfgArr
* The pointer to a structure containing dynamic configuration data for the CTB.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_CTB_LoadDynamicConfig(uint8_t ctbIdx, uint8_t ctbDynCfgNum, const cy_stc_autanalog_ctb_dyn_t * ctbDynCfgArr);

/** \} group_autanalog_ctb_functions_init */


/*******************************************************************************
* Function Name: Cy_AutAnalog_CTB_Comp_Read
****************************************************************************//**
*
* Returns the status of the comparator output.
* \note This function applies only to the Opamp in Comparator mode.
*
* \param ctbIdx
* The index of the CTB subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::ctb
*
* \param compIdx
* The index of the Opamp within the CTB.
*
* \return
* The status of the Opamp output in Comparator mode:
* - false means low;
* - true means high.
* \note Under invalid CTB index, "false" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_AutAnalog_CTB_Comp_Read(uint8_t ctbIdx, uint8_t compIdx)
{
    bool result = false;

    uint32_t baseAddr;
    uint32_t regMask;

    CY_ASSERT_L1(AUTANALOG_CTB_COMP_IDX(compIdx));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_CTB, ctbIdx, &baseAddr))
    {
        regMask = (0UL == compIdx) ? CTBL_STA_COMP_STAT_OA0_COMP_Msk : CTBL_STA_COMP_STAT_OA1_COMP_Msk;
        result = (regMask == (AUTANALOG_CTBX_COMP_STATUS(baseAddr) & regMask)) ? true : false;
    }

    return result;
}


/** \} group_autanalog_ctb_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS22LPPASS_CTB */

#endif /** !defined(CY_AUTANALOG_CTB_H) */

/** \} group_autanalog_ctb */

/* [] END OF FILE */
